Revit 2026 API

# ColorBackgroundSettings Class

---

Represents the rendering color background settings.

SystemObject Autodesk.Revit.DBBackgroundSettings Autodesk.Revit.DBColorBackgroundSettings

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ColorBackgroundSettings : BackgroundSettings
```
```vb
Public Class ColorBackgroundSettings
	Inherits BackgroundSettings
```
```cpp
public ref class ColorBackgroundSettings : public BackgroundSettings
```
```fsharp
type ColorBackgroundSettings =
    class
        inherit BackgroundSettings
    end
```

The ColorBackgroundSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Color | The color of the rendering background. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from BackgroundSettings) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from BackgroundSettings) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace